a=int(input('Укажите значение: '))
b=int(input('Укажите значение: '))
c=int(input('Укажите значение: '))

d=int(input('Укажите наименьшее значение интервала: '))
e=int(input('Укажите наибольшее значение интервала: '))

if d<=a<=e:
    print(a)
if d<=b<=e:
    print(b)
if d<=c<=e:
    print(c)
else:
    print()
