print ('Вариант 2')
print ('Задание 1')
import math
def S(f):
    return (3 * math.sqrt(3) * f**2) / 2
a = int(input('Введите сторону а: '))
print ('Площадь правильного шестиугольника равна: ', S(a))
#1. Вычислить площадь правильного шестиугольника со стороной а, используя
#подпрограмму вычисления площади треугольника.

print ('Задание 2')

def pr(a,b):
    return a*b

a1 = int(input('Введите сторону "а" 1-ого прямоугольника: '))
b1 = int(input('Введите сторону "b" 1-ого прямоугольника: '))
a2 = int(input('Введите сторону "а" 2-ого прямоугольника: '))
b2 = int(input('Введите сторону "b" 2-ого прямоугольника: '))
a3 = int(input('Введите сторону "а" 3-ого прямоугольника: '))
b3 = int(input('Введите сторону "b" 3-ого прямоугольника: '))

print ('Площадь первого прямоугольника равна: ',pr(a1,b1))
print ('Площадь второго прямоугольника равна: ',pr(a2,b2))
print ('Площадь третьего прямоугольника равна: ',pr(a3,b3))
#2. Пользователь вводит две стороны трех прямоугольников. Вывести их
#площади.
