print ('Вариант 3')

print ('Задание 1')
import math
a=int(input('Укажите значение: '))
b=int(input('Укажите значение: '))
def pr_treug (a,b):
    return math.sqrt(a**2+b**2)
print (pr_treug(a,b))

print ('Задание 2')
w=input('Напишите слово: ')
b = sorted(w)
c = ''.join(b)
print(c)

#1. Даны катеты двух прямоугольных треугольников. Написать функцию
# вычисления длины гипотенузы этих треугольников. Сравнить и вывести какая из
# гипотенуз больше, а какая меньше.
# 2. Преобразовать строку так, чтобы буквы каждого слова в ней были
# отсортированы по алфавиту.
