print ('Вариант 3')

print ('Задание 1')
import math
a1=int(input('Первый треуг. 1-ый катет: '))
b1=int(input('Первый треуг. 2-ый катет: '))
a2=int(input('Второй треуг. 1-ый катет: '))
b2=int(input('Второй треуг. 2-ый катет: '))
def pr_treug (a,b):
    return math.sqrt(a**2+b**2)
if pr_treug(a1,b1)>pr_treug(a2,b2):
    print ('Гипотенуза первого треуг. больше, чем второго')
else:
    print('Гипотенуза второго треуг. больше, чем первого')

print ('Задание 2')
w=input('Напишите слово: ')
b = sorted(w)
c = ''.join(b)
print(c)

#1. Даны катеты двух прямоугольных треугольников. Написать функцию
# вычисления длины гипотенузы этих треугольников. Сравнить и вывести какая из
# гипотенуз больше, а какая меньше.
# 2. Преобразовать строку так, чтобы буквы каждого слова в ней были
# отсортированы по алфавиту.
