a=int(input('Введите количество чисел из ряда Фибоначчи: '))
b=0
c=1
i=0
m= [b, c]

while i<a-2:
    s=b+c
    b=c
    c=s
    i=i+1
    m.append(c)

print(sum(m))

#9. Пользователь вводит число N с клавиатуры - количество чисел из ряда Фибоначчи. Посчитайте сумму этих чисел
