k=0
s1 = input('Введите слово, которое нужно найти: ')
s2 = input('Введите строку: ')
while (s1 in s2):
    s2=s2.replace (s1,'',1)
    k+=1
print(k)

#9. Определить, сколько раз в тексте встречается заданное слово
