def f():
    a = int(input())
    while a!=0:
        print(a)
        return f()
f()
# 3. Дана последовательность натуральных чисел(одно число в строке), завершающаяся числом 0.
# Выведите первое, третье, пятое и т.д.из введенных чисел.
# Завершающий ноль выводить не надо. В этой задаче нельзя использовать глобальные переменные и передавать
# какие - либо параметры в рекурсивную функцию.
# Функция получает данные, считывая их с клавиатуры.Функция не возвращает значение, а сразу же
# выводит результат на экран.Основная программа должна состоять только из вызова этой функции
