print ('Задание 3')

print ('Блок B')

def posl():
    a = int(input('Введите кол-во элементов последовательности: '))
    for i in range(a):
        b=int(input('Введите элементы: '))
        if i%2==0:
            print(b)
        else:
            pass

posl()
# 3. Дана последовательность натуральных чисел(одно число в строке), завершающаяся числом 0.
# Выведите первое, третье, пятое и т.д.из введенных чисел.
# Завершающий ноль выводить не надо. В этой задаче нельзя использовать глобальные переменные и передавать
# какие - либо параметры в рекурсивную функцию.
# Функция получает данные, считывая их с клавиатуры.Функция не возвращает значение, а сразу же
# выводит результат на экран.Основная программа должна состоять только из вызова этой функции
