print ('Вариант 5')

print ('Задание 1')

m=int(input('Введите количество строк: '))
n=int(input('Введите количество столбцов: '))
a=[]
for i in range(m):
    b = []
    for j in range (n):
        print('Введите [', i, ',' ,j,'] элемент')
        b.append(int(input()))
    a.append(b)
c=[]
for i in a:
    c.append(sorted(i))

print('Измененный массив:')
for i in range(m):
    for j in range(n):
        print(c[i][j], end=' ')
    print()

#1. Упорядочить по возрастанию элементы каждой строки матрицы
#размером n х m.
#2. Дана действительная матрица размером n х m, все элементы которой
#различны. В каждой строке выбирается элемент с наименьшим
#значением. Если число четное, то заменяется нулем, нечетное -
#единицей. Вывести на экран новую матрицу.
