print('Вариант 1')
print('Задание 1')
m = int(input('Кол-во элементов в массиве: '))
n = []
for i in range(m):
    n.append(int(input('Элементы массива: ')))
print('Максимальный элемент: ', max(n))
print('Массив в обратном порядке: ', list(reversed(n)))

#1. Дан одномерный массив, состоящий из N целочисленных элементов. Ввести
#массив с клавиатуры. Найти максимальный элемент. Вывести массив на экран в
#обратном порядке.

print('Задание 2')
m1 = int(input('Кол-во элементов в массиве: '))
n1 = []
for i in range(m1):
    n1.append(int(input('Элементы массива: ')))
sr = sum(n1)/len(n1)
for i in range(len(n1)):
    if n1[i] == 0:
        n1[i] = sr
print(n1)

#2. В массиве действительных чисел все нулевые элементы заменить на среднее
#арифметическое всех элементов массива.
