print('Вариант 2')
print('Задание 1')
m = int(input('Кол-во элементов в массиве: '))
n = []
for i in range(m):
    n.append(int(input('Элементы массива: ')))
print('Индекс минимального элемента: ', n.index(min(n)))

#1. Дан одномерный массив, состоящий из N целочисленных элементов. Ввести
#массив с клавиатуры. Найти минимальный элемент. Вывести индекс
#минимального элемента на экран

print('Задание 2')
m1 = int(input('Кол-во элементов в массиве: '))
perv = []
vtor = []
tret = []
for i in range(m1):
    perv.append(int(input('Элементы массива: ')))

for i in range(len(perv)):
    if perv[i] > 0:
        vtor.append(perv[i])
    else:
        tret.append(perv[i])

print('Второй массив: ', vtor)
print('Третий массив: ', tret)
#2. Дан массив целых чисел. Переписать все положительные элементы во второй
#массив, а остальные - в третий
