print ('Вариант 4')
print ('Задание 1')
n = int(input('Кол-во чисел в массиве: '))
mas = [] #создаем пустой массив
for i in range(n):
    mas.append(int(input('Числа в массиве: '))) #заполняем массив
k=0

for i in mas:
    k+=1  #счетчик
    if i == max(mas):
        print(max(mas), k) #нашли его порядковый номер

#1. Дан массив целых чисел. Найти максимальный элемент массива и его 
#порядковый номер.

print ('Задание 2')
n = int(input('Кол-во чисел в массиве: '))
mas0 = [] #создаем пустой массив
for i in range(n):
    mas0.append(int(input('Числа в массиве: '))) #заполняем массив
mas1 = []
for j in mas0:
    if j%2==1: 
        mas1.append(j)
    else:
        pass
if len(mas1)==0:
    print('В массиве нет нечетных чисел')
else:
    mas1.sort(reverse=True)  #сортировка в убывании
    print(mas1)

#2. Дан одномерный массив целого типа. Получить другой массив, состоящий
#только из нечетных чисел исходного массива или сообщить, что таких чисел нет.
#Полученный массив вывести в порядке убывания элементов.
