from random import randint

print('Вариант 4')
print('Задание 1')
n = int(input('Кол-во элементов в массиве: '))
d = []
for i in range(n):
    d.append(randint(10, 50))
print(d, min(d), d.index(min(d))+1)

#1. Дан массив целых чисел. Найти максимальный элемент массива и его
#порядковый номер

print('Задание 2')
m1 = int(input('Кол-во элементов в массиве: '))
n = []
for i in range(m1):
    n.append(randint(10, 100))
k = []
for i in n:
    if i%2==1:
        k.append(i)
    else:
        pass
print(n)
if len(k) == 0:
    print('В массиве нет нечетных чисел')
else:
    k.sort(reverse=True)  # сортировка в убывании
    print(k)
#2. Дан одномерный массив целого типа. Получить другой массив, состоящий
#только из нечетных чисел исходного массива или сообщить, что таких чисел нет.
#Полученный массив вывести в порядке убывания элементов