from random import randint

print('Вариант 9')
print('Задание 1')
n = int(input('Кол-во элементов в массиве: '))
d = []
for i in range(n):
    d.append(float(input('Элемент массива: ')))
print(d)
min1 = 0
for i in range(len(d)):
    if abs(d[i])<abs(d[i-1]):
        min1 = abs(d[i])
print(min1)
print(list(reversed(d)))
#1. Дан одномерный массив, состоящий из N вещественных элементов. Ввести
#массив с клавиатуры. Найти и вывести минимальный по модулю элемент.
#Вывести массив на экран в обратном порядке

print('Задание 2')
m1 = 10
a = []
b = []
for i in range(m1):
    a.append(randint(1, 10))
    b.append(randint(1, 10))
print('Массив А: ', a, 'Массив В: ', b)
a, b = b, a
print('Массив А: ', a, 'Массив В: ', b)


#2. Даны массивы A и B одинакового размера 10. Вывести исходные массивы.
#Поменять местами их содержимое и вывести в начале элементы
#преобразованного массива A, а затем — элементы преобразованного массива B